#==============================================================#
"""Task 2.1"""
#solution!
#==============================================================#

#==============================================================#
#solution!
#==============================================================#

"""
#Task 2.2
Повторяй за мной 2
Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

Примечание. Используйте 3 переменные для сохранения введённых строк текста.
"""
# def (*args, **kwargs):
#     profile]
#     [aslf]aklfpakpfsa]ks[f]


#==============================================================#
"""Task 2.2"""
#solution!
#==============================================================#
a = int(input())
print(a+1)
print(a+1)